# CannotGroupCurtainGridHost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..CannotGroupCurtainGridHost Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Curtain grid based elements cannot be grouped.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotGroupCurtainGridHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotGroupCurtainGridHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotGroupCurtainGridHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace